app/Controllers/Notas.php

    public function adicionar($id = null)
    {
        $model = new NotaModel();

        $titulo = $this->request->getVar("titulo");
        $conteudo = $this->request->getVar("conteudo");
        $destaque = $this->request->getVar("destaque");

        if ($destaque === "on") {
            $destaque = true;
        } else {
            $destaque = false;
        }

        if ($id == null) {
            $model->save([
                'titulo'    => $titulo,
                'conteudo'  => $conteudo,
                'dataHora'  => Time::now(),
                'destaque'  => $destaque
            ]);
---
INSERT INTO `notas` (`titulo`, `conteudo`, `dataHora`, `destaque`) VALUES ('teste2', 'ttegsdgsdg', '2024-05-09 13:55:14', 0)

    public function excluir($id = null)
    {
        $model = new NotaModel();

        $model->where('id', $id)->delete();
---
DELETE FROM `notas`
WHERE `id` = '58'