app/Models/NotaModel.php

    public function getNota($id = null)
    {
        if ($id) {
            return $this->where('id', $id)->orderBy('destaque', 'DESC')->find();
        } else {
            return $this->orderBy('destaque', 'DESC')
                ->findAll();
---
SELECT *
FROM `notas`
ORDER BY `destaque` DESC